リストに変換

```
> Enum.to_list 1..5
[1, 2, 3, 4, 5]
> Enum.to_list %{one: 1, two: 2, three: 3}
[one: 1, three: 3, two: 2]
> Enum.to_list {1, 2, 3}
** (Protocol.UndefinedError) protocol Enumerable not implemented for {1, 2, 3}
    (elixir) lib/enum.ex:1: Enumerable.impl_for!/1
    (elixir) lib/enum.ex:141: Enumerable.reduce/3
    (elixir) lib/enum.ex:1919: Enum.reverse/1
    (elixir) lib/enum.ex:2588: Enum.to_list/1
> Enum.to_list [a: "a", b: "b", c: "c"]
[a: "a", b: "b", c: "c"]
```

