リストに変換

```
> Enum.to_list 1..5
[1, 2, 3, 4, 5]
> Enum.to_list %{one: 1, two: 2, three: 3}
[one: 1, three: 3, two: 2]
> Enum.to_list {1, 2, 3}
** (Protocol.UndefinedError) protocol Enumerable not implemented for {1, 2, 3}
    (elixir) lib/enum.ex:1: Enumerable.impl_for!/1
    (elixir) lib/enum.ex:141: Enumerable.reduce/3
    (elixir) lib/enum.ex:1919: Enum.reverse/1
    (elixir) lib/enum.ex:2588: Enum.to_list/1
> Enum.to_list [a: "a", b: "b", c: "c"]
[a: "a", b: "b", c: "c"]
```

結合

```
> Enum.concat([1, 2, 3], [4, 5, 6])
[1, 2, 3, 4, 5, 6]
> Enum.concat([1, 2, 3], 'abc')
[1, 2, 3, 97, 98, 99]
> Enum.concat([1, 2, 3], %{four: 4, five: 5})
[1, 2, 3, {:five, 5}, {:four, 4}]
> Enum.concat(%{one: 1, two: 2}, %{three: 3, four: 4})
[one: 1, two: 2, four: 4, three: 3]
> Enum.concat({1, 2, 3}, {4, 5, 6})
** (Protocol.UndefinedError) protocol Enumerable not implemented for {1, 2, 3}
    (elixir) lib/enum.ex:1: Enumerable.impl_for!/1
    (elixir) lib/enum.ex:141: Enumerable.reduce/3
    (elixir) lib/enum.ex:1919: anonymous fn/3 in Enum.concat/1
    (elixir) lib/enum.ex:1899: Enum."-concat/1-lists^foldl/2-1-"/3
    (elixir) lib/enum.ex:1899: Enum.concat/1
> Enum.concat({:one, 1}, {:two, 2})
** (Protocol.UndefinedError) protocol Enumerable not implemented for {:one, 1}
    (elixir) lib/enum.ex:1: Enumerable.impl_for!/1
    (elixir) lib/enum.ex:141: Enumerable.reduce/3
    (elixir) lib/enum.ex:1919: anonymous fn/3 in Enum.concat/1
    (elixir) lib/enum.ex:1899: Enum."-concat/1-lists^foldl/2-1-"/3
    (elixir) lib/enum.ex:1899: Enum.concat/1
> Enum.concat([one: 1], [two: 2])
[one: 1, two: 2]
```

