```
> b = <<1, 2, 3>>
<<1, 2, 3>>
> byte_size b
3
> bit_size b
24
```

```
> b = <<1::size(2), 1::size(3)>>
<<9::size(5)>>
> byte_size b
1
> bit_size b
5
> 0b01_001
9
```

