# 20.6 コード片を走らせる他の方法

`Code.eval_quated(quated, bindings \\ [], opts \\ [])
- quoted: `quote` が返すような抽象構文木
- binding: `quoted` に渡す変数名と値のキーワードリスト
- opts:  
    オプション  
    詳細は `Code.eval_string/3` 参照

```
> fragment = quote do: IO.puts("hello")
{{:., [], [{:__aliases__, [alias: false], [:IO]}, :puts]}, [], ["hello"]}
> Code.eval_quoted fragment
hello
{:ok, []}
```

バインディングを指定して、quote内からquote外の変数にアクセスする場合

```
> fragment = quote do: IO.puts(var!(a))
{{:., [], [{:__aliases__, [alias: false], [:IO]}, :puts]}, [],
 [{:var!, [context: Elixir, import: Kernel], [{:a, [], Elixir}]}]}
> Code.eval_quoted fragment, [a: "cat"]
cat
{:ok, [a: "cat"]}
```

`Kernel.var!(var, context \\ nil)`
- var: 参照する変数名
- context: 変数のコンテキスト

