# 真偽値

```
> :true == (1.0 == 1)
true
> :false == (1.0 === 1)
true
```

# 比較演算子

```
> 1.0 === 1
false
> 1.0 == 1
true
> 1.0 !== 1
true
> 1.0 != 1
false
```
