```
> sum = fn (a, b) -> a + b end
#Function<12.99386804/2 in :erl_eval.expr/5>
> sum.(1, 2)
3
> greet = fn -> IO.puts "Hello" end
#Function<20.99386804/0 in :erl_eval.expr/5>
> greet.()
Hello
:ok
> f1 = fn a, b -> a * b end
#Function<12.99386804/2 in :erl_eval.expr/5>
> f1.(5, 6)
30
> f2 = fn -> 99 end
#Function<20.99386804/0 in :erl_eval.expr/5>
> f2.()
99
```

