```
> fun1 = fn -> fn -> "Hello" end end
#Function<20.99386804/0 in :erl_eval.expr/5>
> fun1.()
#Function<20.99386804/0 in :erl_eval.expr/5>
> fun1.().()
"Hello"
```

```
> fun1 = fn -> (fn -> "Hello" end) end
#Function<20.99386804/0 in :erl_eval.expr/5>
> other = fun1.()
#Function<20.99386804/0 in :erl_eval.expr/5>
> other.()
"Hello"
```

