関数を引数として渡す

```
> times_2 = fn n -> n * 2 end
#Function<6.99386804/1 in :erl_eval.expr/5>
> apply = fn (fun, value) -> fun.(value) end
#Function<12.99386804/2 in :erl_eval.expr/5>
> apply.(times_2, 6)
12
```

`Enum.map`を使った例

```
> list = [1, 3, 5, 7, 9]
[1, 3, 5, 7, 9]
> Enum.map list, fn elem -> elem * 2 end
[2, 6, 10, 14, 18]
> Enum.map list, fn elem -> elem * elem end
[1, 9, 25, 49, 81]
> Enum.map list, fn elem -> elem > 6 end
[false, false, false, true, true]
```

