IEx起動時に読み込む

```
goh@goh% iex mm/times.exs
Erlang/OTP 20 [erts-9.2.1] [source] [64-bit] [smp:4:4] [ds:4:4:10] [async-threads:10] [hipe] [kernel-poll:false] [dtrace]

Interactive Elixir (1.6.1) - press Ctrl+C to exit (type h() ENTER for help)
> Times.double 4
8
```

IEx起動後に読み込む

```
> c "mm/times.exs"
[Times]
> Times.double 4
8
> Times.double 123
246
```

