```
> is_atom IO
true
> is_atom Example
true
```

```
> to_string IO
"Elixir.IO"
> to_string Example
"Elixir.Example"
```

```
> :"Elixir.IO" === IO
true
> :"Elixir.Example" === Example
true
```

```
> IO.puts 123
123
:ok
> :"Elixir.IO".puts 123
123
:ok
```

