Erlangのモジュールの呼び出し
`:モジュール名.関数名`

```
> :io.format("The number is ~3.1f~n", [5.678])
The number is 5.7
:ok
```

`io.format` について

`~f` の使い方
`~小数点を含む全体の桁数.小数点以下の桁数f`

```
> :io.format("The number is ~3.1f~n", [5.678])
The number is 5.7
:ok
> :io.format("The number is ~4.2f~n", [5.678])
The number is 5.68
:ok
> :io.format("The number is ~f~n", [5.678])
The number is 5.678000
:ok
```

桁数が合わない場合

```
> :io.format("The number is ~3.2f~n", [5.678])
The number is ***
:ok
```

データ(5.678)を指定しているのに使わなかった場合

```
> :io.format("The number is ~n", [5.678])
** (ArgumentError) argument error
    (stdlib) :io.format(#PID<0.53.0>, "The number is ~n", [5.678])
```

`~n`: 改行

```
> :io.format("The number is ~4.2f~n", [5.678])
The number is 5.68
:ok
> :io.format("The number is ~4.2f", [5.678])
The number is 5.68:ok
```

