```
> c "mm/guard.exs"
[Guard]
> Guard.what_is 99
99 is a number
:ok
> Guard.what_is :cat
cat is an atom
:ok
> Guard.what_is [1, 2, 3]
[1, 2, 3] is a list
:ok
```

