```
> c "mm/guard.exs"
[Guard]
> Guard.what_is 99
99 is a number
:ok
> Guard.what_is :cat
cat is an atom
:ok
> Guard.what_is [1, 2, 3]
[1, 2, 3] is a list
:ok
```

```
> c "mm/factorial2.exs"
[Factorial]
> Factorial.of 100
93326215443944152681699238856266700490715968264381621468592963895217599993229915608941463976156518286253697920827223758251185210916864000000000000000000000000
> Factorial.of -100
** (FunctionClauseError) no function clause matching in Factorial.of/1

    The following arguments were given to Factorial.of/1:

        # 1
        -100

    mm/factorial2.exs:2: Factorial.of/1
```

