privateでも複数のヘッドを持つ関数を定義できる

```
> defmodule PrivateFunction do
> def list?(a), do: fun(a)
> defp fun(a) when is_list(a), do: true
> defp fun(_), do: false
> end
{:module, PrivateFunction,
 <<70, 79, 82, 49, 0, 0, 4, 144, 66, 69, 65, 77, 65, 116, 85, 56, 0, 0, 0, 150,
   0, 0, 0, 16, 22, 69, 108, 105, 120, 105, 114, 46, 80, 114, 105, 118, 97, 116,
   101, 70, 117, 110, 99, 116, 105, 111, 110, ...>>, {:fun, 1}}
> PrivateFunction.list? {}
false
> PrivateFunction.list? []
true
> PrivateFunction.list? [a: "a"]
true
```

public、private混合な複数のヘッドを持つ関数は定義できない

```
> defmodule PrivateFunction do
> def fun(a) when is_list(a), do: true
> defp fun(a), do: false
> end
** (CompileError) iex:20: defp fun/1 already defined as def
    iex:20: (module)
```

