数値のリストを受け取り、各値を2乗した値を持つ新しいリストを返す

```
> c "lists/mylist1.exs"
warning: redefining module MyList (current version defined in memory)
  lists/mylist1.exs:1

[MyList]
> MyList.square []
[]
> MyList.square [4, 5, 6]
[16, 25, 36]
```

リストのすべての要素に1を足す

```
> c "lists/mylist1.exs"
warning: redefining module MyList (current version defined in memory)
  lists/mylist1.exs:1

[MyList]
> MyList.add_1 []
[]
> MyList.add_1 [1000]
[1001]
> MyList.add_1 [4, 6, 8]
[5, 7, 9]
```

