配列連結

```
> [1, 2, 3] ++ [4, 5, 6]
[1, 2, 3, 4, 5, 6]
```

配列の平準化

```
> List.flatten([[[1], 2], [[[3]]]])
[1, 2, 3]
```

たたみ込み
`reduce` と似ているが、向きを指定できる

```
> List.foldl([1, 2, 3], "", fn value, acc -> "#{value}(#{acc})" end)
"3(2(1()))"
> List.foldr([1, 2, 3], "", fn value, acc -> "#{value}(#{acc})" end)
"1(2(3()))"
```

中の要素を置き換える
(コストがかかる処理)

```
st = [1, 2, 3]
[1, 2, 3]
> List.replace_at(list, 2, "buckle my shoe")
[1, 2, "buckle my shoe"]
```

要素がタプルのリストにアクセスする

`List.keyfind(list, key, position, defaul)`
- list: タプルのリスト
- key: 検索する値
- position: タプルのインデックス
- default: 見つからなかった時に返す値(デフォルトは `nil` )
`position` で指定された要素が `key` とマッチするタプルをタプルを返す

```
st.keyfind(kw, "Dallas", 1)
{:where, "Dallas", "TX"}
> List.keyfind(kw, "TX", 2)
{:where, "Dallas", "TX"}
> List.keyfind(kw, "TX", 1)
nil
> List.keyfind(kw, "TX", 1, "No city called TX")
"No city called TX"
```

`List.keydelete(list, key, position)`
`position` で指定された要素が `key` とマッチするタプルを削除したリストを返す

```
> kw = List.keydelete(kw, "TX", 2)
[name: "Dave", likes: "Programming"]
```

`List.keyreplace(list, key, position, new_tuple)`
`position` で指定された要素が `key` とマッチするタプルを `new_tuple` で置き換えたリストを返す

```
> kw = List.keyreplace(kw, :name, 0, {:first_name, "Dave"})
[first_name: "Dave", likes: "Programming"]
```

