```
> c "ListsAndRecursion-4.exs"
[MyList]
> MyList.span(1, 10)
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
> MyList.span(-5, 7)
[-5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5, 6, 7]
> MyList.span(-15, -7)
[-15, -14, -13, -12, -11, -10, -9, -8, -7]
> MyList.span(5, 2)
[]
```

