```
> c "modules_and_functions-4.exs"
[ModulesAndFunctions]
> ModulesAndFunctions.sum 0
0
> ModulesAndFunctions.sum 1
1
> ModulesAndFunctions.sum 10
55
> ModulesAndFunctions.sum 100
5050
```

